7767517
112 132
Input                    input0                   0 1 input0 0=224 1=224 2=3 -23328=1,1148273363 -23329=1,128.281006
Convolution              Conv_0                   1 1 input0 476 0=64 1=7 3=2 4=3 5=1 6=9408 20=1 21=14 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,10.667728
ReLU                     Relu_1                   1 1 476 213 20=1 21=32708 22=15 23=1 -23328=1,1 -23329=1,10.648603
Pooling                  MaxPool_2                1 1 213 214 1=3 2=2 3=1 5=1 20=1 21=27359 22=15 -23328=1,1 -23329=1,8.890964
Split                    splitncnn_0              1 2 214 214_splitncnn_0 214_splitncnn_1 -23328=1,1 -23329=2,8.890964,8.890964
Convolution              Conv_3                   1 1 214_splitncnn_1 479 0=64 1=3 4=1 5=1 6=36864 20=1 21=123 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,10.819115
ReLU                     Relu_4                   1 1 479 217 20=1 21=23297 22=14 23=1 -23328=1,1 -23329=1,15.384100
Convolution              Conv_5                   1 1 217 482 0=64 1=3 4=1 5=1 6=36864 20=1 21=62 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,8.878518
Eltwise                  Add_6                    2 1 482 214_splitncnn_0 220 0=1 20=1 21=26261 22=15 17=16407 18=14 -23328=1,1 -23329=1,7.125727
ReLU                     Relu_7                   1 1 220 221 20=1 21=16393 22=14 23=1 -23328=1,1 -23329=1,7.129716
Split                    splitncnn_1              1 2 221 221_splitncnn_0 221_splitncnn_1 -23328=1,1 -23329=2,7.129716,7.129716
Convolution              Conv_8                   1 1 221_splitncnn_1 485 0=128 1=3 3=2 4=1 5=1 6=73728 20=1 21=79 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,12.625897
ReLU                     Relu_9                   1 1 485 224 20=1 21=31755 22=15 23=1 -23328=1,1 -23329=1,12.236103
Convolution              Conv_10                  1 1 224 488 0=128 1=3 4=1 5=1 6=147456 20=1 21=51 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,7.911147
Convolution              Conv_11                  1 1 221_splitncnn_0 491 0=128 1=1 3=2 5=1 6=8192 20=1 21=232 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,12.046287
Eltwise                  Add_12                   2 1 488 491 229 0=1 20=1 21=14292 22=15 17=24948 18=14 -23328=1,1 -23329=1,5.254364
ReLU                     Relu_13                  1 1 229 230 20=1 21=32767 22=15 23=1 -23328=1,1 -23329=1,5.254364
Split                    splitncnn_2              1 3 230 230_splitncnn_0 230_splitncnn_1 230_splitncnn_2 -23328=1,1 -23329=3,5.254364,5.254364,5.254364
Convolution              Conv_14                  1 1 230_splitncnn_2 494 0=256 1=3 3=2 4=1 5=1 6=294912 20=1 21=91 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,13.459639
ReLU                     Relu_15                  1 1 494 233 20=1 21=32165 22=15 23=1 -23328=1,1 -23329=1,13.212358
Convolution              Conv_16                  1 1 233 497 0=256 1=3 4=1 5=1 6=589824 20=1 21=64 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,16.165380
Convolution              Conv_17                  1 1 230_splitncnn_1 500 0=256 1=1 3=2 5=1 6=32768 20=1 21=146 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,11.334195
Eltwise                  Add_18                   2 1 497 500 238 0=1 20=1 21=13891 22=15 17=23368 18=14 16=1 -23328=1,1 -23329=1,6.853106
ReLU                     Relu_19                  1 1 238 239 20=1 21=31841 22=15 23=1 -23328=1,1 -23329=1,6.659427
Split                    splitncnn_3              1 3 239 239_splitncnn_0 239_splitncnn_1 239_splitncnn_2 -23328=1,1 -23329=3,6.659427,6.659427,6.659427
Convolution              Conv_20                  1 1 239_splitncnn_2 503 0=512 1=3 3=2 4=1 5=1 6=1179648 20=1 21=84 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,17.144703
ReLU                     Relu_21                  1 1 503 242 20=1 21=17726 22=14 23=1 -23328=1,1 -23329=1,18.548773
Convolution              Conv_22                  1 1 242 506 0=512 1=3 4=1 5=1 6=2359296 20=1 21=36 22=15 23=0 24=2 25=1 26=20660 27=13 -23328=1,1 -23329=1,24.046640
Convolution              Conv_23                  1 1 239_splitncnn_1 509 0=512 1=1 3=2 5=1 6=131072 20=1 21=116 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,14.742352
Eltwise                  Add_24                   2 1 506 509 247 0=1 20=1 21=17001 22=15 17=26724 18=14 16=1 -23328=1,1 -23329=1,12.476174
ReLU                     Relu_25                  1 1 247 248 20=1 21=16387 22=14 23=1 -23328=1,1 -23329=1,12.478767
Convolution              Conv_26                  1 1 230_splitncnn_0 512 0=64 1=1 5=1 6=8192 20=1 21=327 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,10.393051
PReLU                    LeakyRelu_27             1 1 512 251 20=1 21=26709 22=14 23=2 -23328=1,1 -23329=1,16.942560
Convolution              Conv_28                  1 1 239_splitncnn_0 515 0=64 1=1 5=1 6=16384 20=1 21=139 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,11.528593
PReLU                    LeakyRelu_29             1 1 515 254 20=1 21=22897 22=14 23=2 -23328=1,1 -23329=1,16.111143
Convolution              Conv_30                  1 1 248 518 0=64 1=1 5=1 6=32768 20=1 21=112 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,17.474489
PReLU                    LeakyRelu_31             1 1 518 257 20=1 21=32357 22=14 23=2 -23328=1,1 -23329=1,34.510483
Split                    splitncnn_4              1 3 257 257_splitncnn_0 257_splitncnn_1 257_splitncnn_2 -23328=1,1 -23329=3,34.510483,34.510483,34.510483
Interp                   Resize_50                1 1 257_splitncnn_2 276 0=1 3=14 4=14 -23328=1,0 -23329=1,34.510483
Eltwise                  Add_51                   2 1 254 276 277 0=1 20=1 21=13688 22=15 17=17547 18=13 -23328=1,1 -23329=1,14.416630
Convolution              Conv_52                  1 1 277 521 0=64 1=3 4=1 5=1 6=36864 20=1 21=95 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,22.161579
PReLU                    LeakyRelu_53             1 1 521 280 20=1 21=22503 22=14 23=2 -23328=1,1 -23329=1,30.437765
Split                    splitncnn_5              1 3 280 280_splitncnn_0 280_splitncnn_1 280_splitncnn_2 -23328=1,1 -23329=3,30.437765,30.437765,30.437765
Interp                   Resize_72                1 1 280_splitncnn_2 299 0=1 3=28 4=28 -23328=1,0 -23329=1,30.437765
Eltwise                  Add_73                   2 1 251 299 300 0=1 20=1 21=17800 22=15 17=29434 18=14 -23328=1,1 -23329=1,16.534405
Convolution              Conv_74                  1 1 300 524 0=64 1=3 4=1 5=1 6=36864 20=1 21=72 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,19.473534
PReLU                    LeakyRelu_75             1 1 524 303 20=1 21=21833 22=14 23=2 -23328=1,1 -23329=1,25.950216
Split                    splitncnn_6              1 2 303 303_splitncnn_0 303_splitncnn_1 -23328=1,1 -23329=2,25.950216,25.950216
Convolution              Conv_76                  1 1 303_splitncnn_1 527 0=32 1=3 4=1 5=1 6=18432 20=1 21=70 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,16.059845
Convolution              Conv_77                  1 1 303_splitncnn_0 530 0=16 1=3 4=1 5=1 6=9216 20=1 21=74 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,25.477404
PReLU                    LeakyRelu_78             1 1 530 308 20=1 21=22580 22=14 23=2 -23328=1,1 -23329=1,35.112854
Split                    splitncnn_7              1 2 308 308_splitncnn_0 308_splitncnn_1 -23328=1,1 -23329=2,35.112854,35.112854
Convolution              Conv_79                  1 1 308_splitncnn_1 533 0=16 1=3 4=1 5=1 6=2304 20=1 21=97 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,16.059845
Convolution              Conv_80                  1 1 308_splitncnn_0 536 0=16 1=3 4=1 5=1 6=2304 20=1 21=103 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,26.037718
PReLU                    LeakyRelu_81             1 1 536 313 20=1 21=23438 22=14 23=2 -23328=1,1 -23329=1,37.247913
Convolution              Conv_82                  1 1 313 539 0=16 1=3 4=1 5=1 6=2304 20=1 21=128 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,16.059845
Concat                   Concat_83                3 1 527 533 539 316 -23328=1,1 -23329=1,16.059845
ReLU                     Relu_84                  1 1 316 317 20=1 21=16396 22=14 23=1 -23328=1,1 -23329=1,16.072048
Split                    splitncnn_8              1 3 317 317_splitncnn_0 317_splitncnn_1 317_splitncnn_2 -23328=1,1 -23329=3,16.072048,16.072048,16.072048
Convolution              Conv_85                  1 1 280_splitncnn_1 542 0=32 1=3 4=1 5=1 6=18432 20=1 21=62 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,16.221354
Convolution              Conv_86                  1 1 280_splitncnn_0 545 0=16 1=3 4=1 5=1 6=9216 20=1 21=76 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,22.825617
PReLU                    LeakyRelu_87             1 1 545 322 20=1 21=24160 22=14 23=2 -23328=1,1 -23329=1,33.659550
Split                    splitncnn_9              1 2 322 322_splitncnn_0 322_splitncnn_1 -23328=1,1 -23329=2,33.659550,33.659550
Convolution              Conv_88                  1 1 322_splitncnn_1 548 0=16 1=3 4=1 5=1 6=2304 20=1 21=85 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,16.221354
Convolution              Conv_89                  1 1 322_splitncnn_0 551 0=16 1=3 4=1 5=1 6=2304 20=1 21=70 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,20.884043
PReLU                    LeakyRelu_90             1 1 551 327 20=1 21=22463 22=14 23=2 -23328=1,1 -23329=1,28.632235
Convolution              Conv_91                  1 1 327 554 0=16 1=3 4=1 5=1 6=2304 20=1 21=192 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,16.221354
Concat                   Concat_92                3 1 542 548 554 330 -23328=1,1 -23329=1,16.221354
ReLU                     Relu_93                  1 1 330 331 20=1 21=18256 22=14 23=1 -23328=1,1 -23329=1,18.074463
Split                    splitncnn_10             1 3 331 331_splitncnn_0 331_splitncnn_1 331_splitncnn_2 -23328=1,1 -23329=3,18.074463,18.074463,18.074463
Convolution              Conv_94                  1 1 257_splitncnn_1 557 0=32 1=3 4=1 5=1 6=18432 20=1 21=71 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,29.575373
Convolution              Conv_95                  1 1 257_splitncnn_0 560 0=16 1=3 4=1 5=1 6=9216 20=1 21=77 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,31.796759
PReLU                    LeakyRelu_96             1 1 560 336 20=1 21=18849 22=14 23=2 -23328=1,1 -23329=1,36.579727
Split                    splitncnn_11             1 2 336 336_splitncnn_0 336_splitncnn_1 -23328=1,1 -23329=2,36.579727,36.579727
Convolution              Conv_97                  1 1 336_splitncnn_1 563 0=16 1=3 4=1 5=1 6=2304 20=1 21=111 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,29.575373
Convolution              Conv_98                  1 1 336_splitncnn_0 566 0=16 1=3 4=1 5=1 6=2304 20=1 21=177 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,39.555538
PReLU                    LeakyRelu_99             1 1 566 341 20=1 21=24046 22=14 23=2 -23328=1,1 -23329=1,58.053104
Convolution              Conv_100                 1 1 341 569 0=16 1=3 4=1 5=1 6=2304 20=1 21=102 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,29.575373
Concat                   Concat_101               3 1 557 563 569 344 -23328=1,1 -23329=1,29.575373
ReLU                     Relu_102                 1 1 344 345 20=1 21=32264 22=15 23=1 -23328=1,1 -23329=1,29.121016
Split                    splitncnn_12             1 3 345 345_splitncnn_0 345_splitncnn_1 345_splitncnn_2 -23328=1,1 -23329=3,29.121016,29.121016,29.121016
Convolution              Conv_103                 1 1 317_splitncnn_2 346 0=8 1=1 5=1 6=512 20=1 21=150 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,24.617826
Permute                  Transpose_104            1 1 346 347 0=3 -23328=1,0 -23329=1,24.617826
Reshape                  Reshape_110              1 1 347 359 0=4 1=1 2=-1 -23328=1,0 -23329=1,22.039572
Convolution              Conv_111                 1 1 331_splitncnn_2 360 0=8 1=1 5=1 6=512 20=1 21=139 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,22.084631
Permute                  Transpose_112            1 1 360 361 0=3 -23328=1,0 -23329=1,22.084631
Reshape                  Reshape_118              1 1 361 373 0=4 1=1 2=-1 -23328=1,0 -23329=1,22.039572
Convolution              Conv_119                 1 1 345_splitncnn_2 374 0=8 1=1 5=1 6=512 20=1 21=141 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,29.193584
Permute                  Transpose_120            1 1 374 375 0=3 -23328=1,0 -23329=1,29.193584
Reshape                  Reshape_126              1 1 375 387 0=4 1=1 2=-1 -23328=1,0 -23329=1,22.039572
Concat                   Concat_127               3 1 359 373 387 output0 -23328=1,1 -23329=1,22.039572
Convolution              Conv_128                 1 1 317_splitncnn_1 389 0=4 1=1 5=1 6=256 20=1 21=166 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,23.452072
Permute                  Transpose_129            1 1 389 390 0=3 -23328=1,0 -23329=1,23.452072
Reshape                  Reshape_135              1 1 390 402 0=2 1=1 2=-1 -23328=1,0 -23329=1,21.358831
Convolution              Conv_136                 1 1 331_splitncnn_1 403 0=4 1=1 5=1 6=256 20=1 21=206 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,26.435167
Permute                  Transpose_137            1 1 403 404 0=3 -23328=1,0 -23329=1,26.435167
Reshape                  Reshape_143              1 1 404 416 0=2 1=1 2=-1 -23328=1,0 -23329=1,21.358831
Convolution              Conv_144                 1 1 345_splitncnn_1 417 0=4 1=1 5=1 6=256 20=1 21=139 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,21.304274
Permute                  Transpose_145            1 1 417 418 0=3 -23328=1,0 -23329=1,21.304274
Reshape                  Reshape_151              1 1 418 430 0=2 1=1 2=-1 -23328=1,0 -23329=1,21.358831
Concat                   Concat_152               3 1 402 416 430 431 -23328=1,1 -23329=1,21.358831
Convolution              Conv_153                 1 1 317_splitncnn_0 432 0=20 1=1 5=1 6=1280 20=1 21=111 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,11.619958
Permute                  Transpose_154            1 1 432 433 0=3 -23328=1,0 -23329=1,11.619958
Reshape                  Reshape_160              1 1 433 445 0=10 1=1 2=-1 -23328=1,0 -23329=1,11.614897
Convolution              Conv_161                 1 1 331_splitncnn_0 446 0=20 1=1 5=1 6=1280 20=1 21=101 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,11.095342
Permute                  Transpose_162            1 1 446 447 0=3 -23328=1,0 -23329=1,11.095342
Reshape                  Reshape_168              1 1 447 459 0=10 1=1 2=-1 -23328=1,0 -23329=1,11.614897
Convolution              Conv_169                 1 1 345_splitncnn_0 460 0=20 1=1 5=1 6=1280 20=1 21=123 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,18.294386
Permute                  Transpose_170            1 1 460 461 0=3 -23328=1,0 -23329=1,18.294386
Reshape                  Reshape_176              1 1 461 473 0=10 1=1 2=-1 -23328=1,0 -23329=1,11.614897
Concat                   Concat_177               3 1 445 459 473 output2 -23328=1,1 -23329=1,11.614897
Softmax                  Softmax_178              1 1 431 output1 0=2 1=1 -23328=1,0 -23329=1,127.032043
